/* Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. 
Даны два неотрицательных числа m и n.
m = 2, n = 3 -> A(m,n) = 9
m = 3, n = 2 -> A(m,n) = 29 */

Console.Clear();
Console.Write("Введите неотрицательное значение m: ");
int m = int.Parse(Console.ReadLine()!);
Console.Write("Введите неотрицательное значение n: ");
int n = int.Parse(Console.ReadLine()!);

Console.Write(AkkermanFunction(m, n)); 

int AkkermanFunction(int m, int n)
{
    if (m == 0)
    {
        return n + 1;
    }
    else if (n == 0 && m > 0)
    {
        return AkkermanFunction(m - 1, 1);
    }
    else
    {
        return (AkkermanFunction(m - 1, AkkermanFunction(m, n - 1)));
    }
}